In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sea

In [3]:
visa = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\Visadataset.csv")
visa.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified

In [4]:
bank = pd.read_csv(r"C:\Users\prath\FullStackDataScience\my own folder\database\data_files\bank.csv", sep = ';' )
bank.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no

## Properties :

            1. shape
            2. size 
            3. head
            4. tail
            5. dtypes
            6. info
            7. descibe
            8. isnull 
            9. columns 
            10. index

In [5]:
visa.shape

(25480, 12)

In [6]:
visa.size

305760

In [7]:
visa.head(7)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
5,EZYV06,Asia,Master's,Y,N,2339,2012,South,78252.1400,Year,Y,Certified
6,EZYV07,Asia,Bachelor's,N,N,4985,1994,South,53635.3900,Year,Y,Certified

In [8]:
visa.tail(6)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
25474,EZYV25475,Africa,Doctorate,N,N,2594,1979,Northeast,51104.78,Year,Y,Certified
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.57,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.79,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.85,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.77,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.91,Year,Y,Certified

In [9]:
visa.dtypes

case_id                      str
continent                    str
education_of_employee        str
has_job_experience           str
requires_job_training        str
no_of_employees            int64
yr_of_estab                int64
region_of_employment         str
prevailing_wage          float64
unit_of_wage                 str
full_time_position           str
case_status                  str
dtype: object

In [10]:
visa.info()

<class 'pandas.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  str
 1   continent              25480 non-null  str
 2   education_of_employee  25480 non-null  str
 3   has_job_experience     25480 non-null  str
 4   requires_job_training  25480 non-null  str
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  str
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  str
 10  full_time_position     25480 non-null  str
 11  case_status            25480 non-null  str
dtypes: float64(1), int64(2), str(9)
memory usage: 2.3 MB

In [11]:
visa.isnull()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,False,False,False,False,False,False,False,False,False,False,False,False
25476,False,False,False,False,False,False,False,False,False,False,False,False
25477,False,False,False,False,False,False,False,False,False,False,False,False
25478,False,False,False,False,False,False,False,False,False,False,False,False
25479,False,False,False,False,False,False,False,False,False,False,False,False

In [12]:
visa.describe(include='all')

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
count,25480,25480,25480,25480,25480,25480.000000,25480.000000,25480,25480.000000,25480,25480,25480
unique,25480,6,4,2,2,NaN,NaN,5,NaN,4,2,2
top,EZYV01,Asia,Bachelor's,Y,N,NaN,NaN,Northeast,NaN,Year,Y,Certified
freq,1,16861,10234,14802,22525,NaN,NaN,7195,NaN,22962,22773,17018
mean,NaN,NaN,NaN,NaN,NaN,5667.043210,1979.409929,NaN,74455.814592,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,22877.928848,42.366929,NaN,52815.942327,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,-26.000000,1800.000000,NaN,2.136700,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,1022.000000,1976.000000,NaN,34015.480000,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,2109.000000,1997.000000,NaN,70308.210000,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,3504.000000,2005.000000,NaN,107735.512500,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,602069.000000,2016.000000,NaN,319210.270000,NaN,NaN,NaN

In [13]:
visa.describe()

       no_of_employees   yr_of_estab  prevailing_wage
count     25480.000000  25480.000000     25480.000000
mean       5667.043210   1979.409929     74455.814592
std       22877.928848     42.366929     52815.942327
min         -26.000000   1800.000000         2.136700
25%        1022.000000   1976.000000     34015.480000
50%        2109.000000   1997.000000     70308.210000
75%        3504.000000   2005.000000    107735.512500
max      602069.000000   2016.000000    319210.270000

In [14]:
visa.columns.tolist()

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [15]:
visa[1:234:14]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.65,Year,Y,Certified
15,EZYV16,Asia,High School,Y,N,4897,1987,West,74108.02,Year,Y,Denied
29,EZYV30,Asia,Bachelor's,Y,N,758,2009,Northeast,189190.48,Year,Y,Certified
43,EZYV44,North America,Master's,Y,N,2582,1989,South,54614.42,Year,Y,Certified
57,EZYV58,Asia,Bachelor's,Y,N,2825,1996,Northeast,14174.04,Year,Y,Certified
71,EZYV72,Asia,High School,Y,N,1722,2007,South,61521.92,Year,Y,Certified
85,EZYV86,Asia,Master's,Y,N,2480,1981,Northeast,34213.17,Year,Y,Certified
99,EZYV100,Asia,Master's,N,N,107535,1970,West,159645.51,Year,Y,Denied
113,EZYV114,North America,High School,Y,N,1019,2005,South,98966.72,Week,Y,Certified
127,EZYV128,North America,Bachelor's,Y,N,23287,2007,South,75234.64,Year,N,Certified
141,EZYV142,Asia,Master's,Y,N,73909,2004,Midwest,60821.75,Year,Y,Certified
155,EZYV156,Asia,Doctorate,Y,Y,3102,2001,West,81781.43,Year,Y,Certified
169,EZYV170,Asia,Master's,N,N,373,1992,West,71825.63,Week,Y,Denied
183,EZYV184,Asia,Master's,N,N,1929,2001,Midwest,100401.52,Year,Y,Certified
197,EZYV198,Europe,Master's,N,Y,2752,2006,South,21511.58,Year,Y,Certified
211,EZYV212,Asia,Master's,Y,N,3980,1869,South,53767.37,Year,Y,Certified
225,EZYV226,Asia,Bachelor's,Y,N,717,1998,Northeast,100379.63,Year,Y,Certified

In [16]:
type(visa.columns)

pandas.Index

# select the particular series or data from the data frame :

            - we have two methods :
                         
                         1. loc : for rows and columns name (location)
                         2. iloc : for rows and columns by  numbers (position)


                **series** vs **Dataframe**

                        + series and dataframe look

In [17]:
visa

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [18]:
visa[3:153:34][["case_id", "has_job_experience", "requires_job_training"]]

     case_id has_job_experience requires_job_training
3     EZYV04                  N                     N
37    EZYV38                  Y                     Y
71    EZYV72                  Y                     N
105  EZYV106                  Y                     N
139  EZYV140                  Y                     N

In [19]:
# using iloc : 

visa.iloc[13: 664: 45, 4:7]

    requires_job_training  no_of_employees  yr_of_estab
13                      N             1652         2007
58                      N             3510         2007
103                     N              367         1982
148                     N             4273         1884
193                     N           128431         1991
238                     N             3592         1950
283                     Y              433         1912
328                     N             2234         1920
373                     N             3166         1995
418                     N             1363         1982
463                     N             3267         2001
508                     N             1446         2007
553                     N             1746         1984
598                     N            26957         1917
643                     N             3189         1838

In [20]:
visa.iloc[[100, 300, 38], [5]]

     no_of_employees
100             2227
300             3268
38              2206

In [21]:
visa.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='str')

In [22]:
visa.values

array([['EZYV01', 'Asia', 'High School', ..., 'Hour', 'Y', 'Denied'],
       ['EZYV02', 'Asia', "Master's", ..., 'Year', 'Y', 'Certified'],
       ['EZYV03', 'Asia', "Bachelor's", ..., 'Year', 'Y', 'Denied'],
       ...,
       ['EZYV25478', 'Asia', "Master's", ..., 'Year', 'N', 'Certified'],
       ['EZYV25479', 'Asia', "Master's", ..., 'Year', 'Y', 'Certified'],
       ['EZYV25480', 'Asia', "Bachelor's", ..., 'Year', 'Y', 'Certified']],
      shape=(25480, 12), dtype=object)

In [23]:
visa.values[100]

array(['EZYV101', 'Asia', "Master's", 'Y', 'N', 2227, 2007, 'Northeast',
       28243.79, 'Year', 'Y', 'Certified'], dtype=object)

In [24]:
visa.iloc[[100]]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified

In [25]:
visa.iloc[[100]].keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='str')

In [26]:
visa.iloc[[105]].values

array([['EZYV106', 'North America', 'Doctorate', 'Y', 'N', 2317, 1995,
        'Island', 41613.52, 'Year', 'Y', 'Certified']], dtype=object)

In [27]:
visa.iloc[100].index

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='str')

In [28]:
visa.iloc[100]

case_id                    EZYV101
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2227
yr_of_estab                   2007
region_of_employment     Northeast
prevailing_wage           28243.79
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 100, dtype: object

In [29]:
visa.iloc[[100]]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified

In [30]:
visa.iloc[[100, 200, 300], ]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [31]:
visa.iloc[[100, 200, 300], :]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [32]:
visa.iloc[:, [3, 5, 7]].head()

  has_job_experience  no_of_employees region_of_employment
0                  N            14513                 West
1                  Y             2412            Northeast
2                  N            44444                 West
3                  N               98                 West
4                  Y             1082                South

In [33]:
visa.iloc[:, 3]

0        N
1        Y
2        N
3        N
4        Y
        ..
25475    Y
25476    Y
25477    Y
25478    Y
25479    Y
Name: has_job_experience, Length: 25480, dtype: str

In [34]:
visa.iloc[:, [3]]

      has_job_experience
0                      N
1                      Y
2                      N
3                      N
4                      Y
...                  ...
25475                  Y
25476                  Y
25477                  Y
25478                  Y
25479                  Y

[25480 rows x 1 columns]

In [35]:
visa.iloc[:, :]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [36]:
visa[:, 1]

InvalidIndexError: (slice(None, None, None), 1)

In [ ]:
visa[:, [1]]

InvalidIndexError: (slice(None, None, None), [1])

In [ ]:
visa.loc[100]

case_id                    EZYV101
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2227
yr_of_estab                   2007
region_of_employment     Northeast
prevailing_wage           28243.79
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 100, dtype: object

In [ ]:
visa.loc[[100,399], ["case_id", "continent", "full_time_position"]]

     case_id continent full_time_position
100  EZYV101      Asia                  Y
399  EZYV400      Asia                  Y

In [ ]:
visa.loc[100:105, 3:7]

TypeError: cannot do slice indexing on Index with these indexers [3] of type int

In [ ]:
visa.loc[100:105, "has_job_experience" : "region_of_employment"]

,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment
100,Y,N,2227,2007,Northeast
101,Y,N,334,2007,Midwest
102,Y,N,224,2008,Midwest
103,Y,N,367,1982,West
104,Y,N,306,2003,Northeast
105,Y,N,2317,1995,Island

In [37]:
visa.loc[100]

case_id                    EZYV101
continent                     Asia
education_of_employee     Master's
has_job_experience               Y
requires_job_training            N
no_of_employees               2227
yr_of_estab                   2007
region_of_employment     Northeast
prevailing_wage           28243.79
unit_of_wage                  Year
full_time_position               Y
case_status              Certified
Name: 100, dtype: object

In [38]:
visa.loc[[100]]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified

In [39]:
visa.loc[[100, 200, 300], ]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [40]:
visa.loc[[100, 200, 300], :]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
100,EZYV101,Asia,Master's,Y,N,2227,2007,Northeast,28243.79,Year,Y,Certified
200,EZYV201,Asia,Doctorate,Y,N,3282,1979,West,74441.11,Year,Y,Certified
300,EZYV301,Asia,Master's,Y,N,3268,2012,Midwest,101371.21,Year,Y,Certified

In [41]:
visa.loc[:, ["requires_job_training", "has_job_experience" ]]

      requires_job_training has_job_experience
0                         N                  N
1                         N                  Y
2                         Y                  N
3                         N                  N
4                         N                  Y
...                     ...                ...
25475                     Y                  Y
25476                     N                  Y
25477                     N                  Y
25478                     Y                  Y
25479                     N                  Y

[25480 rows x 2 columns]

In [42]:
visa.loc[:, "has_job_experience"]

0        N
1        Y
2        N
3        N
4        Y
        ..
25475    Y
25476    Y
25477    Y
25478    Y
25479    Y
Name: has_job_experience, Length: 25480, dtype: str

In [43]:
visa.loc[:, ["has_job_experience"]]

      has_job_experience
0                      N
1                      Y
2                      N
3                      N
4                      Y
...                  ...
25475                  Y
25476                  Y
25477                  Y
25478                  Y
25479                  Y

[25480 rows x 1 columns]

In [44]:
visa.loc[:, :]

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

### dtypes :

In [45]:
visa.dtypes

case_id                      str
continent                    str
education_of_employee        str
has_job_experience           str
requires_job_training        str
no_of_employees            int64
yr_of_estab                int64
region_of_employment         str
prevailing_wage          float64
unit_of_wage                 str
full_time_position           str
case_status                  str
dtype: object

In [46]:
visa.dtypes.keys()

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='str')

In [47]:
visa.dtypes.values

array([<StringDtype(storage='python', na_value=nan)>,
       <StringDtype(storage='python', na_value=nan)>,
       <StringDtype(storage='python', na_value=nan)>,
       <StringDtype(storage='python', na_value=nan)>,
       <StringDtype(storage='python', na_value=nan)>, dtype('int64'),
       dtype('int64'), <StringDtype(storage='python', na_value=nan)>,
       dtype('float64'), <StringDtype(storage='python', na_value=nan)>,
       <StringDtype(storage='python', na_value=nan)>,
       <StringDtype(storage='python', na_value=nan)>], dtype=object)

In [56]:
visa.dtypes.index

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='str')

In [57]:
df = pd.DataFrame(zip(visa.dtypes.keys(), visa.dtypes.values), columns = ["columns", "data_types"])

In [58]:
df

                  columns data_types
0                 case_id        str
1               continent        str
2   education_of_employee        str
3      has_job_experience        str
4   requires_job_training        str
5         no_of_employees      int64
6             yr_of_estab      int64
7    region_of_employment        str
8         prevailing_wage    float64
9            unit_of_wage        str
10     full_time_position        str
11            case_status        str

In [66]:
df1 = pd.DataFrame({ "index" : visa.dtypes.index,"data types" : visa.dtypes.values})
df1

                    index data types
0                 case_id        str
1               continent        str
2   education_of_employee        str
3      has_job_experience        str
4   requires_job_training        str
5         no_of_employees      int64
6             yr_of_estab      int64
7    region_of_employment        str
8         prevailing_wage    float64
9            unit_of_wage        str
10     full_time_position        str
11            case_status        str

In [71]:
cat_col = []
numerical = []
for i, j in zip(visa.dtypes.index, visa.dtypes.values) :
    if j == "str" :
        cat_col.append(i)
    else :
        numerical.append(i)

cat_col, numerical

(['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'],
 ['no_of_employees', 'yr_of_estab', 'prevailing_wage'])

In [73]:
df = pd.DataFrame({"cate" : cat_col, "numerical" : numerical})

ValueError: All arrays must be of the same length

## select types

In [85]:
visa.select_dtypes(exclude="str").columns, visa.select_dtypes(include=["str"]).columns.tolist()

(Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='str'),
 ['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'])

## Ways to select the columns :

                    -   visa["columnName"]
                    -   visa[["columnName"]]
                    -   visa.columnName
                    -   visa.iloc[:, 1]
                    -   visa.iloc[:, [1]]
                    -   visa.loc[:, "columnsNmae"]
                    -   visa.loc[:, ["columnsNmae"]]

In [87]:
visa["continent"].head()

0      Asia
1      Asia
2      Asia
3      Asia
4    Africa
Name: continent, dtype: str

In [89]:
visa[["continent"]].head()

  continent
0      Asia
1      Asia
2      Asia
3      Asia
4    Africa

In [92]:
visa.continent.head()

0      Asia
1      Asia
2      Asia
3      Asia
4    Africa
Name: continent, dtype: str

In [94]:
visa.iloc[:, 1].head()

0      Asia
1      Asia
2      Asia
3      Asia
4    Africa
Name: continent, dtype: str

In [96]:
visa.iloc[:, [1]].head()

  continent
0      Asia
1      Asia
2      Asia
3      Asia
4    Africa

In [98]:
visa.loc[:, "continent"].head()

0      Asia
1      Asia
2      Asia
3      Asia
4    Africa
Name: continent, dtype: str

In [100]:
visa.loc[:, ["continent"]].head()

  continent
0      Asia
1      Asia
2      Asia
3      Asia
4    Africa

## Continent Column : single columns analysis

In [101]:
visa["continent"]

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: str

#### df.unique()

In [102]:
visa["continent"].unique()

<StringArray>
['Asia', 'Africa', 'North America', 'Europe', 'South America', 'Oceania']
Length: 6, dtype: str

#### df.nunique()

In [103]:
visa["continent"].nunique()

6

##### select Asia continent

In [108]:
visa[visa["continent"] == "Asia"].index.size

16861

In [ ]:
pd.DataFrame({i : visa[visa["continent"] == i].index.size for i in visa["continent"].unique().tolist()}, index =[0])

    Asia  Africa  North America  Europe  South America  Oceania
0  16861     551           3292    3732            852      192

In [117]:
pd.DataFrame({"continent" : [i for i in visa["continent"].unique()], "count" : [visa[visa["continent"] == i].index.size for i in visa["continent"].unique()]})

       continent  count
0           Asia  16861
1         Africa    551
2  North America   3292
3         Europe   3732
4  South America    852
5        Oceania    192

#### value counts (frequency) :

In [118]:

visa["continent"].value_counts()

continent
Asia             16861
Europe            3732
North America     3292
South America      852
Africa             551
Oceania            192
Name: count, dtype: int64

In [125]:
pd.DataFrame({"continent" : visa["continent"].value_counts().keys(), "count" : visa["continent"].value_counts().values}).sort_values(by = ["continent"])

       continent  count
4         Africa    551
0           Asia  16861
1         Europe   3732
2  North America   3292
5        Oceania    192
3  South America    852

In [124]:
count_continent